nuclei-v3/S/sap-listlogfiles-disclosure.yaml

http:
- matchers:
  - part: body
    type: word
    words:
    - ListLogFilesResponse
  - condition: and
    part: body
    type: word
    words:
    - <file>
    - <filename>
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - "POST / HTTP/1.1\nHost: {{Hostname}}\nContent-Type: text/xml; charset=UTF-8\n\
    SOAPAction: '\"\"'\n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<SOAP-ENV:Envelope\
    \ xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <SOAP-ENV:Header>\n\
    \    <sapsess:Session xmlns:sapsess=\"http://www.sap.com/webas/630/soap/features/session/\"\
    >\n      <enableSession>true</enableSession>\n    </sapsess:Session>\n  </SOAP-ENV:Header>\n\
    \  <SOAP-ENV:Body>\n    <ns1:ListLogFiles xmlns:ns1=\"urn:SAPControl\"/>\n  </SOAP-ENV:Body>\n\
    </SOAP-ENV:Envelope>\n"
id: sap-listlogfiles-disclosure
info:
  author: LRVT,l4rm4nd
  description: 'Detected SAP systems where the SAP Start Service (sapstartsrv) SAPControl
    SOAP interface exposes the ListLogFiles web method without authentication.

    '
  metadata:
    max-request: 1
  name: SAPControl ListLogFiles - Disclosure
  reference:
  - https://learning.sap.com/courses/technical-implementation-and-operation-i-of-sap-s-4hana-and-sap-business-suite/log-and-trace-information-for-system-start-and-stop
  - https://sapbasisinfo.com/blog/2017/01/20/sapcontrol-command-funtions-for-sap-hana/
  - https://itsiti.com/csmon/
  - https://www.networkintelligence.ai/blogs/sap-security-assessment-methodology-part-2-credential-less-attack-vectors/
  severity: medium
  tags: misconfig,sap,sapcontrol,soap,log,disclosure
